{   
    "experiences": 
        [
            {   "company":"Binghamton University",
                "title":"Software Developer",
                "dates":"September 2019 - Present",
                "location":"Binghamton, NY",
                "duties":[
                    "I support update and develop several applications and workflows for organizations Binghamton University including ITS, EH&S, UCTD, UPD, PF, Libraries, etc. as a full stack software developer.",
                    "I participated in the implementation of BComply, which is a replacement product of VComply LMS for Binghamton University’s Compliance Training. We as a team has developed a new web application that belongs to Binghamton University using Laravel, Graphene Forms, Graphene DataGrids and other additional technologies. I designed and implemented bulk assignments that lets admins to create assignment rules, such as observing user attributes or group attributes to make an assignment on any update or assign the training at a given date by the given attributes. I also implemented reminders to notify users that their assigned trainings are almost due or past the due date, which uses a scheduled Cron Job. Additionally, I implemented user permissions, security access rules and routes. I also manage the script that synchronize users of BComply nightly with Binghamton University’s users. I also assisted creating admin dashboard, end user dashboard, and documentation of admin portal usage of the web application",
                    "I was a member of a search committee that was gathered to search for an appropriate candidate for a position at ITS in Binghamton University. Our search was successful, and a candidate was hired.",
                    "I implemented several Microapps in Graphene (myBinghamton) for students, staff, faculty and several departments in Binghamton University using Ractive, JavaScript, and Mustache. I have also implemented several APIs in GrapheneAPIGateway that feed the microapps developed by me or other lead developers. I currently support the microapps developed by me and make the changes clients request.",
                    "I implemented several Graphene Workflows in Graphene (myBinghamton) for students, staff, faculty and several departments in Binghamton University using Ractive, JavaScript, and Mustache. I have also implemented several APIs in GrapheneAPIGateway those feed the workflows developed by me or other lead developers. These workflows have the following capabilities: document uploads, logics, states, methods and etc. I currently support the workflows developed by me and make the changes clients request.",
                    "I meet with clients to gather requirements for several projects that includes new workflows, new microapps.",
                    "I provided training on Graphene Workflows to an employee in ITS. Additionally, I am a resource for any questions on Graphene Microapps, Workflows, or GrapheneAPIGateway for all ITS employees, including student employees.",
                    "I actively contribute to Graphene GitHub Repository. I am implementing automated actions in Graphene Workflows due to inactivity which uses a scheduled Cron Job.",
                    "I currently a have working local installation of Graphene and GrapheneAPIGateway that I use to implement mycontributions to Graphene Github Repository.",
                    "I deployed a copy of Graphene on AWS Elastic Beanstalk to gain more experience on Graphene DevOps Operations which utilizes PHP7.4, EC2, RDS, MySQL, etc. This copy also utilizes Security Groups implementations in AWS to manage limited access to required population."
                ]
            },
            {
                "company":"Kopernik Observatory and Science Center",
                "title":"Software Developer Intern",
                "dates":"July 2018 - August 2018",
                "location":"Vestal, NY",
                "duties":["Involved in debugging of a mobile app in both IOS and Android platform by using React-Native and JavaScript.",
                    "Debugged the code that uses the Google calendar API and Google Maps API for IOS and Android within the application, and fixed the application running issues.",
                    "Fixed the bugs of the firebase push notifications",
                    "Met with the manager on a weekly basis to provide a detailed project report and milestone updates"
                ]
            },
            {
                "company":"ValuAg LLC",
                "title":"Sofware Developer Intern",
                "dates":"June 2018 - July 2018",
                "location":"Binghamton, NY",
                "duties":[
                    "Tested the given flow in the website using the Google Chrome Developer Tools’ debugger and provided feedbacks to the web developers",
                    "Introduced with EDI billing format during my internship",
                    "Introduced to front end and back end web development",
                    "Introduced to Elastic Search so that the web application’s behaviors and tests can be tracked in a controlled approach"
                ]
            },
            {   
                "company":"Custom Systems Integration",
                "title":"Software Developer Intern",
                "dates":"September 2017 - May 2018",
                "location":"Endicott, NY",
                "duties":[
                    "Involved in implementation of a resume analysis application by using Python, Google Vision API and MySQL",
                    "Used Google Vision API to convert images from JPG, PNG to txt format",
                    "Used Redux to parse the text to acquire emails, phone numbers from the text in order to use applicant’s email as primary key in MySQL database",
                    "Implemented a constantly running Python Application to check the workspace folder if a new image was added",
                    "Designed and implemented GUI for a better user experience by using Python Tkinter Library",
                    "Made database normalization in MySQL to have a better experience and efficiency in MySQL",
                    "Met with the manager on a weekly basis to provide a detailed project report and milestone updates."
                ]
            },
            {
                "company":"Vodafone",
                "title":"IT Intern",
                "dates":"November 2016 - May 2017",
                "location":"Istanbul, Turkey",
                "duties":[
                    "Contributed to Mercury Project which was one of the biggest projects in the Europe that was related to physically migrating a company database to another location by consistently keeping records of the Firewall Requests those were related to relocation of an application or a hardware.",
                    "Kept records of the user access forms, Firewall access forms and DNS access forms and tracked the process.",
                    "Reported in a daily manner to the supervisors and managers."
                ]
            }
        ],
    "projects":[
        {}

    ]

}
